<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"6f26c44c93314a0a5fba0010fbab8d9956cce0e91651d1d4372bb4c1784f8051","plan_job_ref":"Job Plan Airflow DAGs #419 at https://github.com/cal-itp/data-infra/actions/runs/16661742200","plan_out_hash":"8e9ec106bcbf450202cf342f2762c95608c2879df7bb3e91d7ec7301674f2fe1","plan_hash":"6b5bf529883ab19cbdd09d47222ebf0d85763e4a9583811583d39df70b949299","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "UfJCjg==" -> (known after apply)
!~      detect_md5hash      = "4XW2isagZH5zd2S+Ffwq1w==" -> "different hash"
!~      generation          = 1753499810051939 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "4XW2isagZH5zd2S+Ffwq1w==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_trip_updates_summaries.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "84OnIQ==" -> (known after apply)
!~      detect_md5hash      = "kAEmHBZSBj1BFL66yCVYXg==" -> "different hash"
!~      generation          = 1749663120677853 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_trip_updates_summaries.sql"
!~      md5hash             = "kAEmHBZSBj1BFL66yCVYXg==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_trip_updates_summaries.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "mf3T4A==" -> (known after apply)
!~      detect_md5hash      = "yMVXYKWBO0ZNJNkHUN+zwQ==" -> "different hash"
!~      generation          = 1753499811234496 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "yMVXYKWBO0ZNJNkHUN+zwQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #419](https://github.com/cal-itp/data-infra/actions/runs/16661742200)